<?php

return [

    'success' => 'درخواست شما با موفقیت انجام شد',
    'logout' => 'خروج با موفقیت انجام شد. منتظر بازگشت شما هستیم',
    'error' => 'درخواست شما با خطا مواجه شد',

    'accessToken' => [
        'valid' => 'توکن معتبر است',
        'invalid' => 'توکن نامعتبر است',
    ],

    'code' => [
        'success' => 'اس ام اس حاوی کد با موفقیت ارسال شد',
        'expires' => 'کد منقضی شده است',
    ],

    'data' => [
        'list' => 'لیست اطلاعات با موفقیت ارسال شد',
        'show' => 'اطلاعات با موفقیت ارسال شد',
        'invalid_data_input' => 'داده ای ارسالی اشتباه است',
    ],

    'auth' => [
        'guest' => [
            'signError' => 'اپلیکیشن نامعتبر است',
            'success' => 'ورود به صورت مهمان با موفقیت انجام شد',
        ],
        'digit' => [
            'sent' => 'کد موقت ارسال شد',
            'expires' => 'کد موقت منقضی شده است',
            'invalid' => 'کد موقت نامعتبر است',
            'limit_minute' => 'برای دریافت کد جدید :minute دقیقه منتظر بمانید',
            'used' => 'کد موقت قبلا استفاده شده است',
            'success' => 'به فروشگاه خوش آمدید',
        ],
        'jwt' => [
            'refresh' => 'توکن معتبر نیست'
        ],
        'invalidResetToken' => 'توکن بازیابی رمز اشتباه است',
        'logout' => 'خروج با موفقیت انجام شد',
        'firebase' => 'توکن با موفقیت بروزرسانی شد',
        'refresh_token' => 'توکن های جدید ارسال شد',
        'update_profile' => 'اطلاعات پروفایل شما با موفقیت بروزرسانی شد',
        'change_password' => 'گذرواژه شما با موفقیت بروزرسانی شد',
    ],

    'role' => [
        'api_destroy_not' => 'نقش کاربری قابل حذف نیست'
    ],

    'api' => [
        'api_created' => ':table جدید با موفقیت ذخیره شد',
        'api_updated' => ':table با موفقیت بروزرسانی شد',
        'api_destroy' => ':table با موفقیت حذف شد',
    ],

    'users' => 'کاربر',
    'roles' => 'نقش کاربری',

    'address' => [
        'not_found' => 'آدرس یافت نشد'
    ],

    'category' => [
        'not_found' => 'دسته بندی یافت نشد'
    ],

    'product' => [
        'not_found' => 'محصول یافت نشد'
    ],

    'price' => [
        'not_found' => 'محصول یافت نشد',
        'min_count' => 'حداقل تعداد خرید این محصول می بایست :count عدد باشد',
        'max_count' => 'حداکثر تعداد خرید این محصول می بایست :count عدد باشد',
    ],

    'order' => [
        'not_found' => 'سفارش یافت نشد'
    ],

    'payment' => [
        'port' => 'درگاه بانکی انتخاب نشده است',
        'type_not_found' => 'نوع درگاه پرداختی یافت نشد',
        'transaction_not_found' => 'توکن پرداخت یافت و شناسایی نشد',
    ],

    'wallet' => [
        'is_empty' => 'کیف پول شما خالی می باشد',
        'charge' => 'مبلغ :amount تومان برای شارژ کیف پول شما در نظر گرفته شد',
        'desc' => 'مبلغ :price تومان بابت سفارش :order از کیف پول به صورت اتوماتیک کسر شد'
    ],

    'shipping_type' => [
        'not_found' => 'نوع ارسالی یافت نشد'
    ],

    'card' => [
        'not_found' => 'سبد خرید یافت نشد',
        'is_empty' => 'سبد خرید خالی است',
    ],

    'supplier' => [
        'not_found' => 'شعبه انتخابی یافت نشد',
        'status' => 'شعبه انتخابی غیر فعال می باشد',
        'delivery' => [
            'courier' => 'درحال حاضر ارسال با پیک در این شعبه امکان پذیر نیست, از گزینه تغییر آدرس استفاده کنید',
            'presence' => 'درحال حاضر تحویل حضوری در این شعبه امکان پذیر نیست, از گزینه تغییر آدرس استفاده کنید',
        ],
    ],

    'consultation' => [
        'invalid_body' => 'اطلاعات پیام ارسالی نامعتبر است'
    ],

    'discount' => [
        'invalid_code' => 'کد تخفیف نامعتبر می باشد',
        'expires_at' => 'کد تخفیف مورد نظر منقضی شده است',
        'number_of_available' => 'کد تخفیف قابل استفاده نیست',
        'min_order_amount' => 'برای استفاده ازین کد میبایست حداقل :price تومان خرید کنید',
    ],

    'surprise' => [
        'title' => ':amount تومان از فاکتور شما کسر می شود',
        'desc' => 'شگفتانه های نیکان, تخفیف هایی است که به صورت تصادفی, در آخرین لحظه خرید به شما تعلق میگیرد (🤩) و در صورت انصراف از خرید ممکن است تکرار نشود (🤨)',
    ]
];
